Тест/Тест/src/InformationRegisters/АрендаПлощадьОтдела/АрендаПлощадьОтдела.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АрендаПлощадьОтдела</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ИспользуемаяПлощадь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъектАренды</name>
    <type>
      <types>CatalogRef.ОбъектыАренды</types>
    </type>
  </resources>
  <dimensions>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест/Тест/src/InformationRegisters/АрендаСтавка/АрендаСтавка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АрендаСтавка</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>СтавкаМетр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбщаяПлощадь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест/Тест/src/AccumulationRegisters/БюджетТМЦ/БюджетТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>БюджетТМЦ</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТМЦ</name>
    <type>
      <types>CatalogRef.ТМЦВорктрак</types>
    </type>
  </attributes>
  <dimensions>
    <name>Статья</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Категрия</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидыРасхода_3</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Расход</name>
    <type>
      <types>DocumentRef.Расходы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРасхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокРег</name>
    <type>
      <types>DocumentRef.ПоступлениеТМЦВорктрак</types>
      <types>DocumentRef.СписаниеТМЦВорктрак</types>
      <types>DocumentRef.ПеремещениеТМЦВорктрак</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>CatalogRef.ИнвентарныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Коментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест/Тест/src/InformationRegisters/ПланРасходовОтдел/ПланРасходовОтдел.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПланРасходовОтдел</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест/Тест/src/Documents/Расходы/Расходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Расходы</name>
  <basedOn>Document.МаршрутныйЛист</basedOn>
  <basedOn>Document.ПоступлениеЗапчастей</basedOn>
  <basedOn>Document.ЗаказНаряд</basedOn>
  <basedOn>Document.ЛистыУщерба</basedOn>
  <basedOn>Document.ПродажаЗапчастей</basedOn>
  <basedOn>Document.ЗаявкаНаРасход</basedOn>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ОплатыПоСделкам</registerRecords>
  <registerRecords>AccumulationRegister.ТопливоВБаках</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьПеревозок</registerRecords>
  <registerRecords>AccumulationRegister.Баланс</registerRecords>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасхода</name>
    <type>
      <types>CatalogRef.ВидыРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтверждающийДокумент</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Откуда</name>
    <type>
      <types>DocumentRef.ПродажаЗапчастей</types>
    </type>
  </attributes>
  <attributes>
    <name>Зарплата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Работник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Месяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Новые</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>В1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыдачи</name>
    <type>
      <types>EnumRef.ВидВыдачиДенег</types>
    </type>
  </attributes>
  <attributes>
    <name>Org</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>bank</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>bankDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетОткудаРасход</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутныйЛист</name>
    <type>
      <types>DocumentRef.МаршрутныйЛист</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоТопливо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийСписаниеДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПоступлениеЗапчастей</types>
      <types>CatalogRef.ПроектыРазработки</types>
      <types>DocumentRef.АктВозврата</types>
      <types>DocumentRef.ПродажаЗапчастей</types>
      <types>CatalogRef.ТМЦВорктрак</types>
      <types>CatalogRef.Инвентарь</types>
      <types>CatalogRef.СкладСнабжение</types>
      <types>DocumentRef.ЗаказНаряд</types>
      <types>DocumentRef.ЗаявкаНаРасход</types>
      <types>DocumentRef.ЛистыУщерба</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ПроектыРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаРасход</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кредит</name>
    <type>
      <types>DocumentRef.ПриходОтКредитов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРасхода</name>
    <type>
      <types>EnumRef.ТипРасхода</types>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>CatalogRef.Партии</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продажи</name>
    <attributes>
      <name>Продажа</name>
      <type>
        <types>DocumentRef.ПродажаЗапчастей</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусПродажи</name>
      <type>
        <types>EnumRef.СтатусыПродажи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДоставки</name>
      <type>
        <types>EnumRef.СтатусОтправки</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧРасходы</name>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/Catalogs/ВидыРасходов_3/ВидыРасходов_3.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыРасходов_3</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>План</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Влияние</name>
    <type>
      <types>CatalogRef.ВлиянияРасходы</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительРодитель</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительРодительРодитель</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>ОргСтруктураРасходы</name>
    <type>
      <types>CatalogRef.ОргСтруктураРасходы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланРасходы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаВлияние</name>
    <attributes>
      <name>Влияние</name>
      <type>
        <types>CatalogRef.ВлиянияРасходы</types>
      </type>
    </attributes>
    <attributes>
      <name>План</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест/Тест/src/CommonForms/БДР/Module.bsl
// Все  функции и процедуры без подписи делал МазинЕС 25.12.24

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период.ДатаНачала = НачалоМесяца(ТекущаяДатаСеанса()); 
	Период.ДатаОкончания = КонецМесяца(ТекущаяДатаСеанса()); 
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяСтраницаПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	
	Если ТекущаяСтраница = Элементы.ПродажаНН 			Тогда
		ОпределитьДанныеОтдела("000000133","000000542","000000481","000000003"); //(ОтделКод(Расход).ЗарплатаКод,ОтделКод(Доход), РегионКод)
		
	ИначеЕсли ТекущаяСтраница = Элементы.ПродажаМСК 	Тогда
		ОпределитьДанныеОтдела("000000123","000000544","000000479","000000002"); 
		
	ИначеЕсли ТекущаяСтраница = Элементы.ПродажаЕКБ 	Тогда
		ОпределитьДанныеОтдела("000000121","000000473","000000478","000000004"); 
		
	ИначеЕсли ТекущаяСтраница = Элементы.РВРНН 			Тогда
		ОпределитьДанныеОтдела("000000128","000000552","000000482"); 
		
	ИначеЕсли ТекущаяСтраница = Элементы.ЗакупкаНН 		Тогда
		ОпределитьДанныеОтдела("000000492","000000538","000000483"); 
		
	ИначеЕсли ТекущаяСтраница = Элементы.ЗакупкаМСК 	Тогда
		ОпределитьДанныеОтдела("000000243","000000532","000000480");
		
	ИначеЕсли ТекущаяСтраница = Элементы.ЗакупкаЕКБ 	Тогда
		ОпределитьДанныеОтдела("000000417","000000892","000000893"); 
		
	ИначеЕсли ТекущаяСтраница = Элементы.ВостановлениеЗапчастейНН Тогда
		ОпределитьДанныеОтдела("000000865","000000866","000000874"); 
		
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ТекущаяСтраница = Элементы.ОбщаяСтраница.ТекущаяСтраница;
	
	Если ТекущаяСтраница = Элементы.ПродажаНН 			Тогда
		ОпределитьДанныеОтдела("000000133","000000542","000000481","000000003"); //(ОтделКод(Расход).ЗарплатаКод,ОтделКод(Доход), РегионКод)
		
	ИначеЕсли ТекущаяСтраница = Элементы.ПродажаМСК 	Тогда
		ОпределитьДанныеОтдела("000000123","000000544","000000479","000000002"); 
		
	ИначеЕсли ТекущаяСтраница = Элементы.ПродажаЕКБ 	Тогда
		ОпределитьДанныеОтдела("000000121","000000473","000000478","000000004"); 
		
	ИначеЕсли ТекущаяСтраница = Элементы.РВРНН 			Тогда
		ОпределитьДанныеОтдела("000000128","000000552","000000482"); 
		
	ИначеЕсли ТекущаяСтраница = Элементы.ЗакупкаНН 		Тогда
		ОпределитьДанныеОтдела("000000492","000000538","000000483"); 
		
	ИначеЕсли ТекущаяСтраница = Элементы.ЗакупкаМСК 	Тогда
		ОпределитьДанныеОтдела("000000243","000000532","000000480");
		
	ИначеЕсли ТекущаяСтраница = Элементы.ЗакупкаЕКБ 	Тогда
		ОпределитьДанныеОтдела("000000417","000000892","000000893"); 
		
	ИначеЕсли ТекущаяСтраница = Элементы.ВостановлениеЗапчастейНН Тогда
		ОпределитьДанныеОтдела("000000865","000000866","000000874"); 
	КонецЕсли; 
	
	// +++ Заполнить надписи расхода и дохода
	Стуктура = ПолучитьТекстНадписи(Период.ДатаНачала,Период.ДатаОкончания); 
	Элементы.РасходНадпись1.Заголовок = Стуктура.ТекстРасходы;
	Элементы.ПриходНадпись1.Заголовок = Стуктура.ТекстПриходы;
	// --- Заполнить надписи расхода и дохода
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// +++ Заполнить надписи расхода и дохода	
	Стуктура = ПолучитьТекстНадписи(Период.ДатаНачала,Период.ДатаОкончания); 
	Элементы.РасходНадпись1.Заголовок = Стуктура.ТекстРасходы;
	Элементы.ПриходНадпись1.Заголовок = Стуктура.ТекстПриходы;
	// --- Заполнить надписи расхода и дохода
КонецПроцедуры


&наКлиенте
Функция ОпределитьДанныеОтдела(ОтделКод,ЗарплатаКод,ОтделКодДоход,РегионКод = Неопределено) 
	
	// +++ ФОТ
	ФОТОтдел = ФОТ(ОтделКод,ЗарплатаКод,Период.ДатаНачала,Период.ДатаОкончания); 
	// --- ФОТ
	
	// +++ Расходы за аренду
	Структура = ОпределитьЗанимающуюПлощадьотделом(ОтделКод,Период.ДатаОкончания);
	
	Если Структура.ПлощадьЗанимаемая <> 0  И Структура.СтавкаМетр <> 0 И ЗначениеЗаполнено(Структура.ОбъектАренды) Тогда 
		ЗанимаемаяПлощадьОтделом 	= Структура.ПлощадьЗанимаемая;
		ОбъектАрендыСтрока 			= Структура.ОбъектАренды; 
		АрендаСтавка				= Структура.СтавкаМетр; 
		АрендаРасходОтдел 			= Структура.ПлощадьЗанимаемая * Структура.СтавкаМетр; 
	Иначе 
		ЗанимаемаяПлощадьОтделом 	= 0;
		АрендаСтавка				= 0; 
		АрендаРасходОтдел 			= 0; 
		ОбъектАрендыСтрока 			= ""; 
	КонецЕсли; 
	// --- Расходы за аренду
	
	// +++ Расходы на ТМЦ 
	ТМЦОтдел = ТМЦ(ОтделКод,Период.ДатаНачала,Период.ДатаОкончания); 
	// --- Расходы на ТМЦ 
	
	// +++ Сумма проданных товаров без учета перекуп, новый , востановленный и без НДС, Заблокированных
	СуммаВыданыхТоваров = СуммаТоваровДокПродажаЗап(Период.ДатаНачала,Период.ДатаОкончания,РегионКод); 
	СебестоимостьТоваров = СуммаВыданыхТоваров * 0.47; 
	// --- Сумма проданных товаров без учета перекуп, новый , востановленный и без НДС
	
	// +++ Выручка 
	Выручка =  СуммаВыданыхТоваров - СебестоимостьТоваров; 
	// --- Выручка
	
	// +++ Расходы отдела (Фот,ТМЦ и др.)
	РасходыОтдела = РасходыОтделаФункция(Период.ДатаНачала,Период.ДатаОкончания,ОтделКод) - ФОТОтдел; 
	// --- Расходы отдела 
	
	//+++ Расходы остальных отделов (Все расходы которые не принадлежат этим 8 - ми отделам)
	РасходыОстальныхОтделов = РасходыОстальныхОтделов(Период.ДатаНачала,Период.ДатаОкончания);
	//--- Расходы остальных отделов (Все расходы которые не принадлежат этим 8 - ми отделам)
	
	// +++ Общаие доходы по ЗакНар и Продажам (За вычетом налога)
	ОбщаяВыручка = СуммаТоваровДокЗакНарОбщая(Период.ДатаНачала,Период.ДатаОкончания) + СуммаРаботДокЗакНарОбщая(Период.ДатаНачала,Период.ДатаОкончания) + СуммаТоваровДокПродажаЗапОбщая(Период.ДатаНачала,Период.ДатаОкончания); 																		
	// --- Общаие доходы по ЗакНар и Продажам (За вычетом налога)
	
	// +++ Нагрузка по расходам на отдел со стороны других отделов лодырей
	Если ЗначениеЗаполнено(ОбщаяВыручка) Тогда 
		КофНагрузки = СуммаВыданыхТоваров / ОбщаяВыручка; 
		Нагрузка 	= РасходыОстальныхОтделов * КофНагрузки - АрендаРасходОтдел; 
	Иначе 
		КофНагрузки = 0; 
		Нагрузка 	= 0;
	КонецЕсли; 
	// --- Нагрузка по расходам на отдел со стороны других отделов лодырей
	
	// +++ Сумма всех расходов
	ИтогоРасходы = ФОТОтдел + ТМЦОтдел + РасходыОтдела + Нагрузка + АрендаРасходОтдел; 
	// -- Сумма всех расходов
	
	// +++ Прибыль 
	Прибыль = Выручка - ИтогоРасходы; 
	// --- Прибыль 
	
	
	// +++ Задать параметры динамическим спискам
	ЗадатьПараметрыДинСпискамОтделамПродаж(Период.ДатаНачала,Период.ДатаОкончания,ОтделКод); 
	// --- Задать параметры динамическим спискам
	
	// +++ План (ПланФот,ПланПоРасходам и ОбщийПлан)
	ПланФот		= ОпределитьПланФотОтдела(ОтделКод);
	ПланОтдел	= ЗапросПлан(Период.ДатаОкончания,ОтделКод); 
	ПланОбщий 	= ПланФот + ПланОтдел; 
	ПланДельта	= ПланОбщий - ИтогоРасходы;
	// --- План (ПланФот,ПланПоРасходам и ОбщийПлан) 	

КонецФункции

&НаСервереБезКонтекста
Функция ФОТ(ОтделКод,ЗарплатаКод,Дата1,Дата2)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(Расходы.Сумма) КАК Сумма
		|ИЗ
		|	Документ.Расходы КАК Расходы
		|ГДЕ
		|	Расходы.Дата МЕЖДУ &Дата1 И КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ)
		|	И Расходы.Отдел.Код = &Отдел
		|	И Расходы.ВидыРасхода_3.Код = &ВидыРасхода_3";
	
	Запрос.УстановитьПараметр("Отдел", ОтделКод);
	Запрос.УстановитьПараметр("ВидыРасхода_3", ЗарплатаКод);
	
	Запрос.УстановитьПараметр("Дата2", Дата2);
	Запрос.УстановитьПараметр("Дата1", Дата1);
	
	
	Сумма = 0; 	
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий(); 
	Сумма = Выборка.Сумма; 
	
	Если  ЗначениеЗаполнено (Сумма) Тогда  	
		Возврат Сумма; 
	Иначе  
		Возврат 0; 
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОпределитьЗанимающуюПлощадьотделом(ОтделКод,Дата2)
	
	Структура = Новый Структура; 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	АрендаПлощадьОтделаСрезПоследних.ИспользуемаяПлощадь КАК ИспользуемаяПлощадь
		|ИЗ
		|	РегистрСведений.АрендаПлощадьОтдела.СрезПоследних(&Дата, Отдел.Код = &ОтделКод) КАК АрендаПлощадьОтделаСрезПоследних";
	
	Запрос.УстановитьПараметр("ОтделКод", ОтделКод);
	Запрос.УстановитьПараметр("Дата", Дата2);
	
	РезультатЗапроса = Запрос.Выполнить();
	ИспользуемаяПлощадь = 0; 
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		ИспользуемаяПлощадь	= Выборка.ИспользуемаяПлощадь; 
		
	КонецЦикла;  
	
	Структура.Вставить("ПлощадьЗанимаемая",ИспользуемаяПлощадь); 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	АрендаСтавкаСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь,
		|	АрендаСтавкаСрезПоследних.СтавкаМетр КАК СтавкаМетр,
		|	АрендаСтавкаСрезПоследних.Объект КАК ОбъектАренды
		|ИЗ
		|	РегистрСведений.АрендаСтавка.СрезПоследних(&Дата,) КАК АрендаСтавкаСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата2);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтавкаМетр = 0; 
	ОбъектАренд = ""; 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтавкаМетр = ВыборкаДетальныеЗаписи.СтавкаМетр; 
		ОбъектАренд = ВыборкаДетальныеЗаписи.ОбъектАренды; 
	КонецЦикла;
	
	Структура.Вставить("СтавкаМетр",СтавкаМетр);
	Структура.Вставить("ОбъектАренды",Строка(ОбъектАренд));
	
	Возврат Структура;  
		
КонецФункции

&НаСервереБезКонтекста
Функция ТМЦ(ОтделКод,Дата1,Дата2)


	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(БюджетТМЦОстатки.СуммаОстаток) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.БюджетТМЦ.Остатки(, Отдел.Код = &Отдел) КАК БюджетТМЦОстатки
		|ГДЕ
		|	БюджетТМЦОстатки.ДатаРасхода МЕЖДУ &Дата1 И КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ)";
	
	Запрос.УстановитьПараметр("Дата2", Дата2);
	Запрос.УстановитьПараметр("Отдел", ОтделКод);
	Запрос.УстановитьПараметр("Дата1", Дата1);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СуммаОстаток = 0; 
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СуммаОстаток = 	ВыборкаДетальныеЗаписи.СуммаОстаток; 
	КонецЦикла;
	
	Если  ЗначениеЗаполнено (СуммаОстаток) Тогда  	
		Возврат СуммаОстаток; 
	Иначе  
		Возврат 0; 
	КонецЕсли; 
	
КонецФункции

&НаСервереБезКонтекста
Функция СуммаТоваровДокПродажаЗап(Дата1,Дата2,Регион) 
	// +++ Сумма выданных товаров  Без НДС  (Товар: Выдан,НЕотменен. Документ: Проведен) 
	// +++ Без учета перекупа и востановленных запчастей по документу ПродажаЗапчастей
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Сотрудники.Пользователь КАК Пользователь
		|ПОМЕСТИТЬ ВТ_Сотрудники
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.МестоРаботы.Код = &МестоРаботы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажаЗапчастейТаблица.Партия КАК Партия,
		|	ПродажаЗапчастейТаблица.Сумма - ПродажаЗапчастейТаблица.СуммаНДС КАК СуммаБезНалога,
		|	ПродажаЗапчастейТаблица.Ссылка.КтоПродал КАК КтоПродал
		|ПОМЕСТИТЬ ВТ_ТоварыПродажа
		|ИЗ
		|	Документ.ПродажаЗапчастей.Таблица КАК ПродажаЗапчастейТаблица
		|ГДЕ
		|	ПродажаЗапчастейТаблица.Ссылка.Проведен = ИСТИНА
		|	И ПродажаЗапчастейТаблица.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ПродажаЗапчастейТаблица.Ссылка.ДатаБлокировкиПродажи МЕЖДУ &Дата1 И КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ)
		|	И ПродажаЗапчастейТаблица.СтатусТовара = ИСТИНА
		|	И ПродажаЗапчастейТаблица.Отменено = ЛОЖЬ
		|	И ПродажаЗапчастейТаблица.Ссылка.Заблокирована = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Рас_Комплектовка.Инкод КАК Инкод
		|ПОМЕСТИТЬ ВТ_ВостановленыеДетали
		|ИЗ
		|	Документ.Рас_Комплектовка КАК Рас_Комплектовка
		|ГДЕ
		|	Рас_Комплектовка.Дата МЕЖДУ &Дата1 И КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ)
		|	И Рас_Комплектовка.ПометкаУдаления = ЛОЖЬ
		|	И Рас_Комплектовка.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоступлениеЗапчастейТаблица.Партия КАК Партия
		|ПОМЕСТИТЬ ВТ_ПерекупНовыеДетали
		|ИЗ
		|	Документ.ПоступлениеЗапчастей.Таблица КАК ПоступлениеЗапчастейТаблица
		|ГДЕ
		|	ПоступлениеЗапчастейТаблица.Ссылка.Дата МЕЖДУ &Дата1 И КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ)
		|	И ПоступлениеЗапчастейТаблица.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ПоступлениеЗапчастейТаблица.Ссылка.Проведен = ИСТИНА
		|	И (ПоступлениеЗапчастейТаблица.Ссылка.Перекуп = ИСТИНА
		|	ИЛИ ПоступлениеЗапчастейТаблица.Ссылка.Новые = ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ_ТоварыПродажа.СуммаБезНалога) КАК СуммаБезНалога
		|ИЗ
		|	ВТ_ТоварыПродажа КАК ВТ_ТоварыПродажа
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Сотрудники КАК ВТ_Сотрудники
		|		ПО (ВТ_ТоварыПродажа.КтоПродал = ВТ_Сотрудники.Пользователь)
		|ГДЕ
		|	НЕ ВТ_ТоварыПродажа.Партия В
		|		(ВЫБРАТЬ
		|			ВТ_ПерекупНовыеДетали.Партия
		|		ИЗ
		|			ВТ_ПерекупНовыеДетали КАК ВТ_ПерекупНовыеДетали)
		|	И НЕ ВТ_ТоварыПродажа.Партия В
		|		(ВЫБРАТЬ
		|			ВТ_ВостановленыеДетали.Инкод
		|		ИЗ
		|			ВТ_ВостановленыеДетали КАК ВТ_ВостановленыеДетали)";
	
	Запрос.УстановитьПараметр("Дата1", Дата1);
	Запрос.УстановитьПараметр("Дата2", Дата2);
	Запрос.УстановитьПараметр("МестоРаботы", Регион);
	
	СуммаБезНалога = 0; 
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	СуммаБезНалога = Выборка.СуммаБезНалога; 
	
	Если  ЗначениеЗаполнено (СуммаБезНалога) Тогда  	
		Возврат СуммаБезНалога; 
	Иначе  
		Возврат 0; 
	КонецЕсли;  
	// --- Сумма выданных товаров  Без НДС  (Товар: Выдан,НЕотменен. Документ: Проведен) 
	// --- Без учета перекупа и востановленных запчастей по документу ПродажаЗапчастей
КонецФункции 

&НаСервереБезКонтекста
Функция РасходыОтделаФункция(Дата1,Дата2,ОтделКод)
// +++ Расходы отдела
	Запрос1 = Новый Запрос;
	Запрос1.Текст =
		"ВЫБРАТЬ
		|	СУММА(Расходы.Сумма) КАК Сумма
		|ИЗ
		|	Документ.Расходы КАК Расходы
		|ГДЕ
		|	Расходы.Дата МЕЖДУ &Дата1 И КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ)
		|	И Расходы.Отдел.Код = &Отдел";
	
	Запрос1.УстановитьПараметр("Отдел", ОтделКод);
	
	Запрос1.УстановитьПараметр("Дата1", Дата1);
	Запрос1.УстановитьПараметр("Дата2", Дата2);
	
	
	СуммаРасходов = 0; 	
	
	РезультатЗапроса = Запрос1.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий(); 
	СуммаРасходов = Выборка.Сумма; 
	Если  ЗначениеЗаполнено (СуммаРасходов) Тогда  	
		Возврат СуммаРасходов; 
	Иначе  
		Возврат 0; 
	КонецЕсли; 
// --- Расходы отдела	 
КонецФункции

&НаСервереБезКонтекста
Функция РасходыОстальныхОтделов(Дата1,Дата2)
//+++ Расходы остальных отделов (Все расходы которые не принадлежат этим 8 - ми отделам)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(Расходы.Сумма) КАК Сумма,
		|	Расходы.Отдел КАК Отдел,
		|	Расходы.Отдел.Код КАК ОтделКод
		|ПОМЕСТИТЬ ВТ_Нагрузка
		|ИЗ
		|	Документ.Расходы КАК Расходы
		|ГДЕ
		|	Расходы.Дата МЕЖДУ &Дата1 И КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ)
		|	И Расходы.Отдел <> ЗНАЧЕНИЕ(Справочник.ВидыРасходов_3.ПустаяСсылка)
		|	И Расходы.Отдел.Код <> ""000000865""
		|	И Расходы.Отдел.Код <> ""000000492""
		|	И Расходы.Отдел.Код <> ""000000133""
		|	И Расходы.Отдел.Код <> ""000000128""
		|	И Расходы.Отдел.Код <> ""000000417""
		|	И Расходы.Отдел.Код <> ""000000121""
		|	И Расходы.Отдел.Код <> ""000000243""
		|	И Расходы.Отдел.Код <> ""000000123""
		|СГРУППИРОВАТЬ ПО
		|	Расходы.Отдел,
		|	Расходы.Отдел.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ_Нагрузка.Сумма) КАК Сумма
		|ИЗ
		|	ВТ_Нагрузка КАК ВТ_Нагрузка";
	
	Запрос.УстановитьПараметр("Дата1", Дата1);
	Запрос.УстановитьПараметр("Дата2", Дата2);
	
	РасходыОстальныхОтделов = 0; 
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	РасходыОстальныхОтделов = Выборка.Сумма; 	
	Если  ЗначениеЗаполнено (РасходыОстальныхОтделов) Тогда  	
		Возврат РасходыОстальныхОтделов; 
	Иначе  
		Возврат 0; 
	КонецЕсли; 
	
//--- Расходы остальных отделов (Все расходы которые не принадлежат этим 8 - ми отделам)
КонецФункции

&НаСервереБезКонтекста
Функция СуммаТоваровДокПродажаЗапОбщая(Дата1,Дата2)

Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПродажаЗапчастейТаблица.Партия КАК Партия,
		|	ПродажаЗапчастейТаблица.Сумма - ПродажаЗапчастейТаблица.СуммаНДС КАК СуммаБезНалога,
		|	ПродажаЗапчастейТаблица.Ссылка.КтоПродал КАК КтоПродал
		|ПОМЕСТИТЬ ВТ_ТоварыПродажа
		|ИЗ
		|	Документ.ПродажаЗапчастей.Таблица КАК ПродажаЗапчастейТаблица
		|ГДЕ
		|	ПродажаЗапчастейТаблица.Ссылка.Проведен = ИСТИНА
		|	И ПродажаЗапчастейТаблица.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ПродажаЗапчастейТаблица.Ссылка.ДатаБлокировкиПродажи МЕЖДУ &Дата1 И КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ)
		|	И ПродажаЗапчастейТаблица.СтатусТовара = ИСТИНА
		|	И ПродажаЗапчастейТаблица.Отменено = ЛОЖЬ
		|	И ПродажаЗапчастейТаблица.Ссылка.Заблокирована = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ_ТоварыПродажа.СуммаБезНалога) КАК СуммаБезНалога
		|ИЗ
		|	ВТ_ТоварыПродажа КАК ВТ_ТоварыПродажа";
	
	Запрос.УстановитьПараметр("Дата1", Дата1);
	Запрос.УстановитьПараметр("Дата2", Дата2);

	
	СуммаБезНалога = 0; 
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	СуммаБезНалога = Выборка.СуммаБезНалога; 
	
	Если  ЗначениеЗаполнено (СуммаБезНалога) Тогда  	
		Возврат СуммаБезНалога; 
	Иначе  
		Возврат 0; 
	КонецЕсли;

КонецФункции

&НаСервереБезКонтекста
Функция СуммаТоваровДокЗакНарОбщая(Дата1,Дата2)
// ++ Сумма всех товаров в ЗаказНаряде после вычета Налога
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(ЗаказНарядТовары.СуммаВсего - ЗаказНарядТовары.СуммаНалог) КАК СуммаБезНалога
		|ИЗ
		|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
		|ГДЕ
		|	ЗаказНарядТовары.Ссылка.Проведен = ИСТИНА
		|	И ЗаказНарядТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ЗаказНарядТовары.Ссылка.ДатаБлокировкиЗаказНаряда МЕЖДУ &Дата1 И КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ)
		|	И ЗаказНарядТовары.Ссылка.Заблокирован = ИСТИНА";
	
	Запрос.УстановитьПараметр("Дата1", Дата1);
	Запрос.УстановитьПараметр("Дата2", Дата2);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий(); 
	
	СуммаБезНалога1 = 0; 
	СуммаБезНалога1 = Выборка.СуммаБезНалога;	
	
	Если  ЗначениеЗаполнено (СуммаБезНалога1) Тогда  	
		Возврат СуммаБезНалога1; 
	Иначе  
		Возврат 0; 
	КонецЕсли;
// -- Сумма всех товаров в ЗаказНаряде после вычета Налога
КонецФункции
&НаСервереБезКонтекста
Функция СуммаРаботДокЗакНарОбщая(Дата1,Дата2)
// ++ Сумма всех работ в ЗаказНаряде после вычета Налога
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(ЗаказНарядРаботы.СуммаВсего - ЗаказНарядРаботы.СуммаНалог) КАК СуммаБезНалога
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		|ГДЕ
		|	ЗаказНарядРаботы.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ЗаказНарядРаботы.Ссылка.Проведен = ИСТИНА
		|	И ЗаказНарядРаботы.Ссылка.ДатаБлокировкиЗаказНаряда МЕЖДУ &Дата1 И КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ)
		|	И ЗаказНарядРаботы.Ссылка.Заблокирован = ИСТИНА";
	
	Запрос.УстановитьПараметр("Дата1", Дата1);
	Запрос.УстановитьПараметр("Дата2", Дата2);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий(); 
	СуммаБезНалога = 0; 
	СуммаБезНалога = Выборка.СуммаБезНалога;	
	
	Если  ЗначениеЗаполнено (СуммаБезНалога) Тогда  	
		Возврат СуммаБезНалога; 
	Иначе  
		Возврат 0; 
	КонецЕсли; 
// -- Сумма всех работ в ЗаказНаряде после вычета Налога
КонецФункции

&НаСервереБезКонтекста
Функция ЗапросПлан(дата2,Отдел)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПланРасходовОтделСрезПоследних.Сумма КАК Сумма
		|ИЗ
		|	РегистрСведений.ПланРасходовОтдел.СрезПоследних(&Дата2, Отдел.Код = &Отдел) КАК ПланРасходовОтделСрезПоследних";
	
	Запрос.УстановитьПараметр("Отдел", Отдел);
	Запрос.УстановитьПараметр("Дата2", Дата2);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();	
	Выборка.Следующий();
	План = 0; 
	План = Выборка.Сумма; 
	
	Если  ЗначениеЗаполнено (План) Тогда  	
		Возврат План; 
	Иначе  
		Возврат 0; 
	КонецЕсли; 
КонецФункции
	
&НаСервере
Функция ЗадатьПараметрыДинСпискамОтделамПродаж(Дата1,Дата2,Отдел = неопределено)

	СписокПродажии.Параметры.УстановитьЗначениеПараметра("Дата1",Дата1);
	СписокПродажии.Параметры.УстановитьЗначениеПараметра("Дата2",Дата2);

	СписокРасходы.Параметры.УстановитьЗначениеПараметра("Дата1",Дата1);
	СписокРасходы.Параметры.УстановитьЗначениеПараметра("Дата2",Дата2);
	СписокРасходы.Параметры.УстановитьЗначениеПараметра("Отдел",Отдел);
	
	
	СписокТМЦрасходы.Параметры.УстановитьЗначениеПараметра("Дата1",Дата1);
	СписокТМЦрасходы.Параметры.УстановитьЗначениеПараметра("Дата2",Дата2);
	СписокТМЦрасходы.Параметры.УстановитьЗначениеПараметра("Отдел",Отдел);
	
КонецФункции

&НаКлиенте
Процедура Продажи(Команда)
	Элементы.СписокПродажии.Видимость = Истина;
	Элементы.СписокРасходы.Видимость = Ложь; 
	Элементы.СписокТМЦрасходы.Видимость = Ложь;  
КонецПроцедуры
	
&НаКлиенте
Процедура Расходы(Команда)
	Элементы.СписокПродажии.Видимость = Ложь;
	Элементы.СписокРасходы.Видимость = Истина; 
	Элементы.СписокТМЦрасходы.Видимость = Ложь;  
КонецПроцедуры

&НаКлиенте
Процедура РасходыТМЦ(Команда)
	Элементы.СписокПродажии.Видимость = Ложь;
	Элементы.СписокРасходы.Видимость = Ложь; 
	Элементы.СписокТМЦрасходы.Видимость = Истина; 
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСписки(Команда)
	Элементы.СписокПродажии.Видимость 	= Ложь;
	Элементы.СписокРасходы.Видимость 	= Ложь; 
	Элементы.СписокТМЦрасходы.Видимость = Ложь; 
КонецПроцедуры


&НаСервереБезКонтекста
Функция ОпределитьПланФотОтдела(Отдел)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ФОТ.ЗПФакт КАК ЗПФакт
		|ИЗ
		|	Справочник.ФОТ КАК ФОТ
		|ГДЕ
		|	ФОТ.ОтделДДС.Код = &Отдел";
	
	ЗП = 0; 
	Запрос.УстановитьПараметр("Отдел", Отдел);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	ЗП = ВыборкаДетальныеЗаписи.ЗПФакт; 
	
	Если  ЗначениеЗаполнено (ЗП) Тогда  	
		Возврат ЗП; 
	Иначе  
		Возврат 0; 
	КонецЕсли;  
	
КонецФункции

&НаСервереБезКонтекста 
Функция ПолучитьТекстНадписи(Дата1,Дата2)	
// +++ вывести надписи с основными показателями 

	Структура  = Новый Структура; 

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(Расходы.Сумма) КАК Сумма
		|ИЗ
		|	Документ.Расходы КАК Расходы
		|ГДЕ
		|	Расходы.ДатаРасхода МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Дата1", Дата1);
	Запрос.УстановитьПараметр("Дата2", Дата2);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	 
	Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сумма) ТОгда 
		Структура.Вставить("ТекстРасходы",Строка(ВыборкаДетальныеЗаписи.Сумма));
	иначе 
		Структура.Вставить("ТекстРасходы","0");
	КонецЕсли; 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(ПриходДенегНаСчет.СуммаДокумента) КАК СуммаДокумента
		|ИЗ
		|	Документ.ПриходДенегНаСчет КАК ПриходДенегНаСчет
		|ГДЕ
		|	ПриходДенегНаСчет.ДатаПрихода МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Дата1", Дата1);
	Запрос.УстановитьПараметр("Дата2", Дата2);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СуммаДокумента) ТОгда 
		Структура.Вставить("ТекстПриходы",Строка(ВыборкаДетальныеЗаписи.СуммаДокумента));
	иначе 
		Структура.Вставить("ТекстПриходы","0");
	КонецЕсли; 
	
	
	Возврат Структура; 
	КонецФункции
